@Didainius, changing suballocated ip addresses (adding a range or extend the range) requires the edge to be destroyed. Is it as expected?
```
Terraform will perform the following actions:

  # vcd_edgegateway.edge1 must be replaced
-/+ resource "vcd_edgegateway" "edge1" {
        advanced                        = false
        configuration                   = "compact"
      ~ default_external_network_ip     = "10.23.96.91" -> (known after apply)
      ~ default_gateway_network         = "Ext-Net-Coll-01" -> (known after apply)
        description                     = "edge gw created by terraform"
        distributed_routing             = false
      ~ external_network_ips            = [
          - "10.23.96.91",
        ] -> (known after apply)
        fips_mode_enabled               = false
        fw_default_rule_action          = "deny"
        fw_default_rule_logging_enabled = false
        fw_enabled                      = true
        ha_enabled                      = false
      ~ id                              = "urn:vcloud:gateway:51757609-4401-4ba0-a0bd-8b0c08dc6afe" -> (known after apply)
        lb_acceleration_enabled         = false
        lb_enabled                      = false
        lb_logging_enabled              = false
        lb_loglevel                     = "info"
        name                            = "org-test_1_edge_1"
        org                             = "org-test_1"
      ~ use_default_route_for_dns_relay = false -> (known after apply)
        vdc                             = "org-test_1_PAYG_1"

      - external_network { # forces replacement
          - enable_rate_limit   = false -> null
          - incoming_rate_limit = 0 -> null
          - name                = "Ext-Net-Coll-01" -> null
          - outgoing_rate_limit = 0 -> null

          - subnet {
              - gateway               = "10.23.96.1" -> null
              - ip_address            = "10.23.96.91" -> null
              - netmask               = "255.255.255.128" -> null
              - use_for_default_route = true -> null

              - suballocate_pool {
                  - end_address   = "10.23.96.94" -> null
                  - start_address = "10.23.96.91" -> null
                }
            }
        }
      + external_network { # forces replacement
          + enable_rate_limit   = false
          + incoming_rate_limit = 0
          + name                = "Ext-Net-Coll-01"
          + outgoing_rate_limit = 0

          + subnet {
              + gateway               = "10.23.96.1"
              + ip_address            = "10.23.96.91"
              + netmask               = "255.255.255.128"
              + use_for_default_route = true

              + suballocate_pool {
                  + end_address   = "10.23.96.98"
                  + start_address = "10.23.96.91"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```